Change diagram format in README to mermaid
